{"featureName": "Feature: Project setup", "featureInfo": "In order to ensure quality of the digital built environment\nAs a responsible digital citizen\nWe expect compliant OpenBIM deliverables", "vendorsImport": {"ArchiCAD": ["Full", "https://foobar1.com "], "BlenderBIM": ["Full", "https://foobar2.com"], "FreeCAD": ["Partial", "https://foobar3.com"], "Revit": ["Broken", "https://foobar4.com"], "Tekla": ["Unknown", "https://foobar5.com"]}, "vendorsExport": {"ArchiCAD": ["Partial", "https://foobar6.com"], "BlenderBIM": ["Full", "https://foobar7.com"], "FreeCAD": ["Partial", "https://foobar8.com"], "Revit": ["Full", "https://foobar9.com "], "Tekla": ["Unknown", "https://foobar10.com"]}, "scenarios": {"Scenario: Receiving a file": [["IFC data must use the \"<code contenteditable>{schema}</code>\" schema", "IFC data must use the \"IFC4\" schema", "BIM data may be structured using a particular version of IFC, \nknown as the \"schema\" version. Newer versions add lots of capabilities like \nextra parameters, new data relationships, and improved data classification. \nThe version you choose will affect what data can be stored, and which programs\nhave support for reading and writing that version. At the moment, you are\nlikely to specify either \"IFC2X3\" or \"IFC4\".\n"]], "Scenario: Exempt files": [["The IFC file \"<code contenteditable>{file}</code>\" is exempt from being provided", "The IFC file \"PROJECT.ifc\" is exempt from being provided", "Sometimes, projects may create BIM data that is purely temporary, or as a workaround\nthat is needed as part of their workflow, but not required from a contractual\nperspective. In this case, it is advisable for the requirements to explicitly exclude\nthese BIM files so that the client knows what is included in the scope of requirements.\nSimply specify the name of the file that you know is not required as a deliverable.\n"], ["No further requirements are specified because \"<code contenteditable>{reason}</code>\"", "No further requirements are specified because \"it will be superseded in a future project phase\"", "The recipient may not necessarily wish to specify more BIM requirements to audit. Scenarios \nwhen this is the case may be when the recipient does not have processes in place to use\nthe BIM data or does not know how to use the BIM data, or when the BIM data is temporary or\nirrelevant for any reason. In this scenario, it may be useful to specify the reason why\nno further audits will take place. This is the contractual equivalent to \"this page is\nintentionally left blank\".\n"]], "Scenario: Project metadata is organised and correct": [["The project must have an identifier of \"<code contenteditable>{guid}</code>\"", "The project must have an identifier of \"28q3AgmxP5cepIweO5Of$o\"", "This is a 22 character GlobalId for a particular IFC element.\n"], ["The project name, code, or short identifier must be \"<code contenteditable>{name}</code>\"", "The project name, code, or short identifier must be \"123FOO\"", "A short poject code or name used to uniquely identify the project, either \nspecified by the client or the BIM author\n"], ["The project must have a longer form name of \"<code contenteditable>{long_name}</code>\"", "The project must have a longer form name of \"123 Foo Street, Tower B Redevelopment\"", "The full project name used to uniquely identify the project, either \nspecified by the client or the BIM author\n"], ["The project must be described as \"<code contenteditable>{description}</code>\"", "The project must be described as \"Redesign of southwest atrium of Tower B\n    to a two-storey space with new interior fitout\"", "A description of what the project is about, to help clarify the project scope.\n"], ["The project must be categorised under \"<code contenteditable>{object_type}</code>\"", "The project must be categorised under \"Commercial\"", "If the project is categorised as a particular arbitrary type, it may be described \nhere. Example categories could be \"Residential\", \"Retail\", \"Commercial\", \"Health\"\nand \"Defence\". Alternatively, it could be categorised as \"Civic\", \"Infrastructure\".\n"], ["The project must contain information about the \"<code contenteditable>{phase}</code>\" phase", " The project must contain information about the \"A\" phase", "If the project is phased or staged, the phase or stage name may be placed here.\n"]]}}